IRP/src/InformationRegisters/JobSettings/JobSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>JobSettings</name>
  <resources>
    <name>Settings</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>AddInfo</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecutorName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Token</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/JobSettings/Forms/RecordForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	ThisObject.Settings = GetSettingsAsString(Record.Token);
	ThisObject.AddInfo = GetAddInfoAsString(Record.Token);
EndProcedure

Function GetSettingsAsString(Token)
	If Not ValueIsFilled(Token) Then
		Return "";
	EndIf;
	
	RecordSet = InformationRegisters.JobSettings.CreateRecordSet();
	RecordSet.Filter.Token.Set(Token);
	RecordSet.Read();
	If RecordSet.Count() Then
		Return RecordSet[0].Settings.Get();
	Else
		Return "";
	EndIf;
EndFunction

Function GetAddInfoAsString(Token)
	If Not ValueIsFilled(Token) Then
		Return "";
	EndIf;
	
	RecordSet = InformationRegisters.JobSettings.CreateRecordSet();
	RecordSet.Filter.Token.Set(Token);
	RecordSet.Read();
	If RecordSet.Count() Then
		Return SerializeToJson(RecordSet[0].AddInfo.Get());
	Else
		Return "";
	EndIf;
EndFunction

Function SerializeToJson(Value)
	JSONWriter = New JSONWriter();
	JSONWriter.SetString();
	XDTOSerializer.WriteJSON(JSONWriter, Value);
	JSON = JSONWriter.Close();
	Return JSON;
EndFunction
